BAS BMEKZU Project/src/Catalogs/ИНАГРО_ТипыЖурналов/ИНАГРО_ТипыЖурналов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИНАГРО_ТипыЖурналов</name>
  <attributes>
    <name>ВидЖурнала</name>
    <type>
      <types>EnumRef.ИНАГРО_ВидыЖурналов</types>
    </type>
  </attributes>
  <attributes>
    <name>Префикс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Примечание</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

BAS BMEKZU Project/src/InformationRegisters/ИНАГРО_НумерацияЖурналовЭлеватора/ИНАГРО_НумерацияЖурналовЭлеватора.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИНАГРО_НумерацияЖурналовЭлеватора</name>
  <resources>
    <name>ТекущийНомерЖурнала</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ТипЖурнала</name>
    <type>
      <types>CatalogRef.ИНАГРО_ТипыЖурналов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидЖурнала</name>
    <type>
      <types>EnumRef.ИНАГРО_ВидыЖурналов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

BAS BMEKZU Project/src/Catalogs/ИНАГРО_ТипыЖурналов/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
	
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда	
		Возврат;	
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("ПоследнийНомер") Тогда
		НомерЖурнала = РегистрыСведений.ИНАГРО_НумерацияЖурналовЭлеватора.СоздатьМенеджерЗаписи();
		НомерЖурнала.ВидЖурнала          = ВидЖурнала;
		НомерЖурнала.ТипЖурнала          = Ссылка;
		НомерЖурнала.ТекущийНомерЖурнала = ЭтотОбъект.ДополнительныеСвойства.ПоследнийНомер;			
		НомерЖурнала.Записать();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти 

#КонецЕсли
